restaurant-discovery-api/app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE (asdfas) LIMIT 1
---
  def index
    @users = User.all

SELECT "users".* FROM "users" WHERE "users"."email" = 'ryturytkuyl' LIMIT 1
INSERT INTO "users" ("name", "email", "password", "created_at", "updated_at") VALUES (NULL, 'ryturytkuyl', 'str', '2025-10-13 01:22:02.490682', '2025-10-13 01:22:02.490682') RETURNING "id"
---
  def create # register
    logger.info " ################ Begin register action"
    # Support both top-level email param and nested user[email]
    incoming_email = params[:email] || params.dig(:user, :email)
    existing_user = User.find_by(email: incoming_email)
    if existing_user
      logger.info " ################ Registration failed: User already exists ################"
      render json: { errorMessage: "User already exists" }, status: :unprocessable_entity
      return
    end

    user = User.new(user_params)
    if user.save

SELECT "users".* FROM "users" WHERE "users"."email" = 'terytr' LIMIT 1
---
  def login
    @user = User.find_by email: params[:email]